---
kind: property
id: P:Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap.PaletteId
source: html/bf96afd8-a507-f993-887f-9d3ad62c6e9a.htm
---
# Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap.PaletteId Property

The palette identifier of the straight.

## Syntax (C#)
```csharp
public int PaletteId { get; set; }
```